nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F82748
package_id: MC56F82748VLH
mcu_data: ksdk2_0
processor_version: 16.3.0
board: TWR-MC56F8200
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '5', peripheral: GPIOC, signal: 'GPIO, 2', pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, pull_enable: disable}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/XB_OUT10/CMPD_O/PWM_2X, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBUTTONsPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_BUTTON_SW1_GPIO, BOARD_BUTTON_SW1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_BUTTON_SW2_GPIO, BOARD_BUTTON_SW2_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC2 (pin 5)  */
    GPIO_PinSetDirection(BOARD_BUTTON_SW1_GPIO, BOARD_BUTTON_SW1_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinSetDirection(BOARD_BUTTON_SW2_GPIO, BOARD_BUTTON_SW2_PIN_MASK, kGPIO_DigitalInput);

    /* Interrupt configuration on GPIOC2 (pin 5): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_BUTTON_SW1_GPIO, BOARD_BUTTON_SW1_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIOF8 (pin 6): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_BUTTON_SW2_GPIO, BOARD_BUTTON_SW2_PIN_MASK, kGPIO_InterruptFallingEdge);

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_2_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_2_DISABLED));

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_8_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_8_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '45', peripheral: GPIOE, signal: 'GPIO, 0', pin_signal: GPIOE0/PWM_0B, identifier: LED_0, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '46', peripheral: GPIOE, signal: 'GPIO, 1', pin_signal: GPIOE1/PWM_0A, identifier: LED_1, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '47', peripheral: GPIOE, signal: 'GPIO, 2', pin_signal: GPIOE2/PWM_1B, identifier: LED_2, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '48', peripheral: GPIOE, signal: 'GPIO, 3', pin_signal: GPIOE3/PWM_1A, identifier: LED_3, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '51', peripheral: GPIOE, signal: 'GPIO, 4', pin_signal: GPIOE4/PWM_2B/XB_IN2, identifier: LED_4, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '52', peripheral: GPIOE, signal: 'GPIO, 5', pin_signal: GPIOE5/PWM_2A/XB_IN3, identifier: LED_5, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '53', peripheral: GPIOE, signal: 'GPIO, 6', pin_signal: GPIOE6/PWM_3B/XB_IN4, identifier: LED_6, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '54', peripheral: GPIOE, signal: 'GPIO, 7', pin_signal: GPIOE7/PWM_3A/XB_IN5, identifier: LED_7, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/PWM_3X/XB_IN2, identifier: LED_8, direction: OUTPUT, gpio_init_state: 'true', pull_select: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

