nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(BOARD_LED_0_GPIO, BOARD_LED_0_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(BOARD_LED_1_GPIO, BOARD_LED_1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(BOARD_LED_2_GPIO, BOARD_LED_2_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_LED_3_GPIO, BOARD_LED_3_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(BOARD_LED_4_GPIO, BOARD_LED_4_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(BOARD_LED_5_GPIO, BOARD_LED_5_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMode(BOARD_LED_6_GPIO, BOARD_LED_6_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMode(BOARD_LED_7_GPIO, BOARD_LED_7_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_LED_8_GPIO, BOARD_LED_8_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOE0 (pin 45)  */
    GPIO_PinWrite(BOARD_LED_0_GPIO, BOARD_LED_0_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_0_GPIO, BOARD_LED_0_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE1 (pin 46)  */
    GPIO_PinWrite(BOARD_LED_1_GPIO, BOARD_LED_1_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_1_GPIO, BOARD_LED_1_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE2 (pin 47)  */
    GPIO_PinWrite(BOARD_LED_2_GPIO, BOARD_LED_2_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_2_GPIO, BOARD_LED_2_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE3 (pin 48)  */
    GPIO_PinWrite(BOARD_LED_3_GPIO, BOARD_LED_3_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_3_GPIO, BOARD_LED_3_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE4 (pin 51)  */
    GPIO_PinWrite(BOARD_LED_4_GPIO, BOARD_LED_4_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_4_GPIO, BOARD_LED_4_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE5 (pin 52)  */
    GPIO_PinWrite(BOARD_LED_5_GPIO, BOARD_LED_5_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_5_GPIO, BOARD_LED_5_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE6 (pin 53)  */
    GPIO_PinWrite(BOARD_LED_6_GPIO, BOARD_LED_6_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_6_GPIO, BOARD_LED_6_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE7 (pin 54)  */
    GPIO_PinWrite(BOARD_LED_7_GPIO, BOARD_LED_7_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_7_GPIO, BOARD_LED_7_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_LED_8_GPIO, BOARD_LED_8_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_8_GPIO, BOARD_LED_8_PIN_MASK, kGPIO_DigitalOutput);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTHERMISTORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '12', peripheral: ADC, signal: 'ANA, 4', pin_signal: GPIOA4/ANA4/CMPD_IN0}
  - {pin_num: '11', peripheral: ADC, signal: 'ANA, 5', pin_signal: GPIOA5/ANA5/CMPD_IN1}
  - {pin_num: '9', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7/CMPD_IN3}
  - {pin_num: '10', peripheral: ADC, signal: 'ANA, 6', pin_signal: GPIOA6/ANA6/CMPD_IN2}
  - {pin_num: '17', peripheral: ADC, signal: 'ANB, 7', pin_signal: GPIOB7/ANB7/CMPB_IN2}
  - {pin_num: '19', peripheral: ADC, signal: 'ANB, 6', pin_signal: GPIOB6/ANB6/CMPB_IN1}
  - {pin_num: '20', peripheral: ADC, signal: 'ANB, 5', pin_signal: GPIOB5/ANB5/CMPC_IN2}
  - {pin_num: '21', peripheral: ADC, signal: 'ANB, 4', pin_signal: GPIOB4/ANB4/CMPC_IN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* Enable peripheral functionality on pin GPIOA4 (pin 12) */
    GPIO_PinSetPeripheralMode(BOARD_THM0P_GPIO, BOARD_THM0P_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA5 (pin 11) */
    GPIO_PinSetPeripheralMode(BOARD_THM0N_GPIO, BOARD_THM0N_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA6 (pin 10) */
    GPIO_PinSetPeripheralMode(BOARD_THM1P_GPIO, BOARD_THM1P_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 9) */
    GPIO_PinSetPeripheralMode(BOARD_THM1N_GPIO, BOARD_THM1N_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB4 (pin 21) */
    GPIO_PinSetPeripheralMode(BOARD_THM2P_GPIO, BOARD_THM2P_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB5 (pin 20) */
    GPIO_PinSetPeripheralMode(BOARD_THM2N_GPIO, BOARD_THM2N_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB6 (pin 19) */
    GPIO_PinSetPeripheralMode(BOARD_THM3P_GPIO, BOARD_THM3P_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB7 (pin 17) */
    GPIO_PinSetPeripheralMode(BOARD_THM3N_GPIO, BOARD_THM3N_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: CAN0, signal: TX, pin_signal: GPIOC11/CANTX/SCL0/TXD1}
  - {pin_num: '38', peripheral: CAN0, signal: RX, pin_signal: GPIOC12/CANRX/SDA0/RXD1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

